<template>
  <v-dialog v-model="show" scrollable max-width="320px">
    <v-card flat tile color="#FFF">
      <v-card-title class="pa-0" style="height: 30px">
        <v-spacer></v-spacer>
        <v-btn
          icon
          @click.native="$emit('update:privacyDialog', false)"
          width="16px"
          height="16px"
          style="padding-right: 20px; padding-top: 5px"
        >
          <v-img src="@/assets/closing-btn.svg"></v-img>
        </v-btn>
      </v-card-title>

      <v-card-text class="pa-3 pt-0 terms_content">
        <span class="terms_title">개인정보 처리방침</span><br />
        <br />
        타시오 개인정보 처리방침<br />
        <br />
        (주)스프링클라우드 (이하 "회사”라 함)는 회사가 제공하는 관련 제반
        서비스인 타시오 자율주행 셔틀 서비스(이하 “서비스”라 한다)의 이용과
        관련하여 서비스 이용자(이하 “회원”라 한다)의 개인정보를 중요시하고,
        정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법,
        통신비밀보호법, 전기통신사업법 등 정보통신서비스 제공자가 준수하여야 할
        관련 법령상의 개인정보보호 규정을 준수하며, 관련 법령에 의거한
        개인정보처리방침을 정하여 회원 권익 보호에 최선을 다하고 있습니다.
        회사는 개인정보 처리방침을 통하여 회원께서 제공하시는 개인정보가 어떠한
        용도와 방식으로 이용되고 있으며, 개인정보보호를 위해 어떠한 조치가
        취해지고 있는지 알려드립니다. <br />
        <br />
        <b>제1조 (수집하는 개인정보의 항목 및 수집방법)</b><br />
        1. 수집하는 개인정보의 항목<br />
        회사는 회원가입(또는 서비스 가입), 원활한 고객상담, 각종 서비스의 제공을
        위해 서비스 최초 이용 시 다음과 같은 개인정보를 수집하고 있습니다.<br />
        2. 개인정보: 회원의 이름, 생년월일, 아이디, 비밀번호, 이메일 주소,
        휴대전화번호, 기타 아래 서비스 이용과정에서 수집되는 정보 및 회원이
        서비스 이용을 위해 자발적으로 입력하는 정보 등<br />
        3. 서비스 이용과정이나 처리 과정에서 아래와 같은 정보들이 자동으로
        생성되어 수집될 수 있습니다.<br />
        : IP Address, 방문 일시, 서비스 이용 기록, 쿠키, 접속 로그, 불량 이용
        기록, 앱 설치정보, <br />
        네트워크 위치정보 등 <br />
        4. 개인정보 수집방법<br />
        회사는 다음과 같은 방법으로 개인정보를 수집합니다.<br />
        1) 홈페이지 또는 어플리케이션 상의 서비스 프로그램 실행 또는 사용
        과정에서 수집<br />
        2) 생성정보 수집 툴(쿠키를 포함)을 통한 수집<br />
        3) 사용 중 회원의 자발적 제공을 통한 수집<br />
        <br />
        <b>제2조 (개인정보의 처리 목적)</b><br />
        회사는 회원의 동의가 있거나 법령의 규정에 의한 경우를 제외하고는 본
        조에서 고지한 범위를 넘어 회원의 개인정보를 활용하지 않습니다. 회사는
        수집한 개인정보를 다음과 같은 목적으로 이용합니다.<br />
        1. 서비스 제공 및 운영<br />
        회원이 가입한 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 콘텐츠
        제공, 차량사고 발생 시 사고처리, 주요 공지사항 등 공지, 회사의 약관 또는
        이용정책의 위반행위 적발을 위한 기록 조회<br />
        2. 회원관리<br />
        회원식별, 본인확인, 개인식별, 이용이 제한된 회원(서비스 이용약관에 따라
        이용 제한된 회원)의 부정이용 방지와 비인가 사용방지, 가입의사 확인 및
        가입회수 제한, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항
        전달, 만 14세 미만 아동의 개인정보 처리시 법정대리인의 동의여부 확인,
        최신 정보 전달, 서비스의 유효성 확인, 접속빈도 파악, 회원의 서비스이용에
        대한 통계 확인 및 파악<br />
        3. (선택적) 신규 서비스 개발 및 마케팅 · 광고에의 활용<br />
        신규 서비스 개발 및 이벤트 관련 광고성 정보안내, 이벤트 경품배송, 고객별
        통계분석자료 활용, 시장조사<br />
        4. 사고발생시 원인 규명 및 처리를 위한 수집 및 이용<br />
        <br />
        <b>제3조 (개인정보의 처리 및 보유기간)</b><br />
        1. 회사는 원칙적으로 회원의 개인정보를 수집한 때로부터 회원 탈퇴
        시까지의 기간에 한하여 개인정보를 보유 및 이용하며, 개인정보 수집 및
        이용목적이 달성된 경우 또는 회원 탈퇴 시에는 해당 정보를 지체없이
        파기합니다. 단, 회사 내부방침이나 관계법령의 규정에 의하여 보존할 필요가
        있는 경우에는 일정 기간 동안 개인정보를 보관할 수 있으며, 이 경우 회사는
        보관하는 정보를 그 보관의 목적으로만 이용합니다.<br />
        2. 구체적인 개인정보 처리 및 보유기간은 다음과 같습니다.<br />
        1) 계약 또는 청약철회 등에 관한 기록: 5년(전자상거래 등에서의
        소비자보호에 관한 법률)<br />
        2) 대금결제 및 재화 등의 공급에 관한 기록: 5년 (전자상거래 등에서의
        소비자보호에 관한 <br />
        법률)<br />
        3) 소비자의 불만 또는 분쟁처리에 관한 기록: 3년 (전자상거래 등에서의
        소비자보호에 관한 <br />
        법률)<br />
        4) 신용정보의 수집/처리 및 이용 등에 관한 기록: 3년 (신용정보의 이용 및
        보호에 관한 법률)<br />
        5) 서비스이용기록, 접속로그, 접속IP정보: 3개월 (통신비밀보호법)<br />
        6) 관계 법령 위반에 따른 수사·조사 등이 진행중인 경우 : 해당 수사·조사
        등 종료시까지<br />
        7) 채권·채무관계가 잔존하는 경우 : 해당 채권·채무관계 정산시까지<br />
        ※ '개인정보 유효기간제’에 따라 1년간 서비스를 이용하지 않은 회원의
        개인정보를 별도로 분리 보관하여 관리하고 있습니다.<br />
        <br />
        <b>제4조 (개인정보의 제3자 제공)</b><br />
        1. 회사는 본 서비스 이용 중 수집된 이용자의 정보를 정보주체의 동의,
        법률의 특별한 규정이 있는 경우에만 제3자에게 제공합니다.<br />
        2. 회사는 업무제휴 등의 목적으로 다음과 같이 개인정보를 제3자에게
        제공하고 있습니다. 다만, 이용자는 개인정보 제공동의를 거부할 권리가
        있으며, 미동의시 서비스 이행을 위한 업무처리가 불가능하여 서비스 제한을
        받으실 수 있습니다.<br />
        <br />
        <b>제5조 (개인정보 파기절차 및 방법)</b><br />
        회원의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체
        없이 파기되며, 법률에 의해 보유되는 경우가 아니고서는 이외의 다른
        목적으로도 이용되지 않습니다. 회사의 개인정보 파기절차 및 방법은 다음과
        같습니다. <br />
        1. 파기절차<br />
        회원이 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로
        옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한
        정보보호 사유(보유 및 이용기간 참조)에 따라 일정 기간 저장된 후
        파기됩니다.<br />
        2. 파기방법<br />
        1) 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여
        파기합니다.<br />
        2) 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적
        방법을 사용하여 삭제합니다.<br />
        <br />
        <b>제6조 (회원 및 법정대리인의 권리, 의무와 그 행사방법)</b><br />
        1. 회원 및 법정대리인은 언제든지 등록되어 있는 자신의 개인정보를
        열람하거나 수정할 수 있으며, 회사의 개인정보의 처리에 동의하지 않는 경우
        동의를 거부하거나 가입해지(회원탈퇴)를 요청할 수 있습니다. 단,
        개인정보에서 이름, 미수금 발생 이력 등 서비스 운영을 위해 확인이 필요한
        정보를 변경할 경우에는 회사의 승인이 이루어질 때까지 서비스 이용이
        제한될 수 있습니다.<br />
        2. 회원의 개인정보 조회 및 수정을 위해서는 "개인정보변경"(또는
        "회원정보수정" 등)을, 가입해지(동의철회)를 위해서는 "회원탈퇴"를, 각
        클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정 또는 탈퇴가
        가능합니다. 혹은 개인정보관리책임자에게 서면 또는 이메일로 연락하시면
        지체 없이 조치하겠습니다.<br />
        3. 회원 또는 법정대리인이 개인정보의 오류에 대한 정정을 요청하신
        경우에는, 회사는 당해 정정을 완료하기 전까지 당해 개인정보를 이용하지
        않습니다. <br />
        4. 서비스에 가입할 수 있는 자는 만 14세 이상이며, 개인정보의 수집∙이용에
        법정 대리인의 동의가 필요한 만 14세 미만 아동의 개인정보는 원칙적으로
        수집하지 않습니다.<br />
        <br />
        <b>제7조 (개인정보 자동 수집 장치의 설치/운영 및 그 거부에 관한 사항)</b
        ><br />
        1. 회사는 고객님의 정보를 수시로 저장하고 찾아내는 ‘쿠키(cookie)’ 등을
        운용합니다. 쿠키란 회사의 홈페이지 및 어플리케이션을 운영하는데 이용되는
        서버가 귀하의 브라우저에 보내는 아주 작은 텍스트 파일로서 귀하의 컴퓨터
        하드디스크에 저장됩니다. <br />
        2. 쿠키 등 사용 목적<br />
        회사의 홈페이지 및 어플리케이션 접속빈도 및 방문시간 분석, 고객의
        관심분야 파악 및 분석, 각종 이벤트 참여 및 방문횟수 파악 등을 통한 타겟
        마케팅 및 개인 맞춤 서비스 제공을 위해 쿠키 등을 사용합니다.<br />
        3. 쿠키의 설치/운영 및 거부 <br />
        회원은 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 웹브라우저
        또는 휴대전화기의 환경에서 옵션을 설정함으로써 모든 쿠키를 허용하거나,
        쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할
        수도 있습니다. 다만, 쿠키의 저장을 거부할 경우에는 로그인이 필요한 일부
        서비스는 이용에 어려움이 있을 수 있습니다.<br />
        <br />
        <b>제8조 (개인정보의 안전성 확보조치)</b><br />
        회사는 회원들의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출,
        변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 대책을
        강구하고 있습니다. 단, 회원 본인의 부주의나 인터넷상의 문제로 ID,
        비밀번호 등 개인정보가 유출되어 발생한 문제에 대해 회사는 일체의 책임을
        지지 않습니다.<br />
        1. 기술적 조치 - 해킹 등에 대비한 대책<br />
        1) 회사는 해킹이나 컴퓨터 바이러스 등에 의해 회원의 개인정보가
        유출되거나 훼손되는 것을 막기 위해 최선을 다하고 있습니다.<br />
        2) 개인정보의 훼손에 대비해서 자료를 백업하고 있고, 최신 보안 패치와
        방화벽을 이용하여 회원들의 개인정보나 자료가 누출되거나 손상되지 않도록
        방지하고 있습니다.<br />
        3) 그리고 기타 시스템적으로 보안성을 확보하기 위한 가능한 모든 기술적
        장치를 갖추려 노력하고 있습니다.<br />
        2. 관리적 조치 - 취급 직원의 최소화 및 교육<br />
        회사의 개인정보관련 취급 직원은 담당자에 한정시키고 있고 이를 위한
        별도의 비밀번호를 부여하여 정기적으로 갱신하고 있으며, 담당자에 대한
        수시 교육을 통하여 개인정보처리방침의 준수를 항상 강조하고 있습니다.
        <br />
        3. 물리적 조치<br />
        전산실, 자료보관실 등의 접근을 통제하고 있습니다.<br />
        <br />
        <b>제9조 (개인정보 보호책임자에 관한 사항)</b><br />
        1. 귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련
        민원을 개인정보관리책임자 혹은 담당부서로 신고하실 수 있습니다. 회사는
        회원들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.<br />
        2. 개인정보 관리책임자<br />
        이름 : 송재윤<br />
        소속 : 전략 마케팅 본부<br />
        직위 : 팀장<br />
        메일 : jysong@aspringcloud.com<br />
        기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에
        문의하시기 바랍니다.<br />
        <br />
        개인정보침해신고센터 (http://www.118.or.kr / 국번없이 118)<br />
        개인정보 분쟁조정위원회 (http://www.kopico.go.kr / 국번없이
        1833-6972)<br />
        대검찰청 사이버범죄수사단 (http://www.spo.go.kr / 02-3480-200 )<br />
        경찰청 사이버테러대응센터 (http://cyberbureau.police.go.kr / 국번없이
        182)<br />
        <br />
        <b>제10조 (개인정보 처리방침의 변경에 관한 사항)</b><br />
        1. 회사는 개인정보 처리방침을 개정하는 경우 개정이유 및 개정내용에
        관하여 E-mail, SNS, App Push 등으로 회원에게 개별 통지할 것입니다.
        회사는 개인정보 처리방침을 변경하는 경우 버전번호 등을 부여하여 변경된
        사항을 회원께서 쉽게 알아보실 수 있도록 하고 있습니다. 본
        개인정보처리방침 버전은 v1.0 이며, 2020년 09월 01일부터 시행됩니다.<br />
        <br />
      </v-card-text>
    </v-card>
  </v-dialog>
</template>

<script>
export default {
  name: "Privacy",
  props: ["privacyDialog"],
  data: () => ({
    show: false,
  }),
  created() {
    this.show = this.privacyDialog;
  },
  watch: {
    privacyDialog() {
      this.show = this.privacyDialog;
    },
    show() {
      if (!this.show) this.$emit("update:privacyDialog", this.show);
      else this.$emit("update:privacyDialog", this.show);
    },
  },
};
</script>

<style scoped>
.terms_title {
  font-family: Noto Sans KR;
  font-style: normal;
  font-weight: 500;
  font-size: 16px;
  color: #e61773;
}

.terms_content {
  font-family: Noto Sans KR;
  font-style: normal;
  font-weight: normal;
  line-height: 17px;
  font-size: 12px !important;
  color: #4f4f4f;
}
</style>