<template>
<v-container class="pt-0 pb-6 pl-5 pr-5 ma-0 flex-wrap text-center" fluid grid-list-md fill-height>
    <v-layout row wrap>
        <v-flex xs12 sm12 md12 class="d-flex flex-column justify-center align-center text-left">
            <v-card class="agree-wrap pa-0" color="transparent" flat tile>
                <v-card-title class="pa-0 pb-4 agree-title">약관에 동의해주세요.</v-card-title>
                <v-card-text class="pa-0 agree-content">
                    <span style="text-decoration-line: underline; color: #2E3990;" @click="servicePolicy">서비스 이용약관, </span>
                    <span style="text-decoration-line: underline; color: #2E3990;" @click="privacyPolicy">개인정보 처리방침, </span>
                    <span style="text-decoration-line: underline; color: #2E3990;" @click="marketingInformation">마케팅 정보 수신 동의</span>
                    에 동의하시겠습니까?
                </v-card-text>

                <v-dialog v-model="serviceDialog" scrollable max-width="320px">
                    <v-card flat tile color="#FFF">
                        <v-card-title class="pa-0" style="height: 30px;">
                            <v-spacer></v-spacer>
                            <v-btn icon @click.native="serviceDialog = false" width="16px" height="16px" style="padding-right: 20px; padding-top: 5px;">
                                <v-img src="../../assets/closing-btn.svg"></v-img>
                            </v-btn>
                        </v-card-title>
                        <v-card-text class="pa-3 pt-0 privacy_content">
                            <span class="privacy_title">서비스 이용약관</span><br>
                            <br>
                            온리원 고군산 자율주행 셔틀 서비스 이용약관<br>
                            <br>
                            <b>제1조 (목적)</b><br>
                            본 약관은 군산시가 제공하는 관련 제반 서비스인 자율주행 셔틀 서비스(이하 “서비스”라 한다)의 이용과 관련하여 군산시와 회원과의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.<br>
                            <br>
                            <b>제2조 (정의)</b><br>
                            본 약관에서 사용하는 용어의 정의는 다음과 같습니다.<br>
                            1. “서비스”라 함은 회원이 군산시의 어플리케이션을 통하여 신청하는 유료 “자율주행 셔틀 운송 서비스”를 말합니다.<br>
                            2. “회원”이라 함은 군산시의 어플리케이션을 통하여 본 약관에 동의 후, 군산시와 서비스 이용계약을 체결한 자를 말합니다.<br>
                            <br>
                            <b>제3조 (약관의 효력 및 변경)</b><br>
                            1. 본 약관은 서비스를 이용하고자 하는 모든 회원에 대하여 그 효력이 발생합니다.<br>
                            2. 본 약관의 내용은 서비스 화면에 게시하거나 기타의 방법으로 회원에게 공시하고, 이에 동의한 회원이 서비스에 가입함으로써 효력이 발생합니다.<br>
                            3. 군산시는 필요하다고 인정되는 경우 본 약관을 변경할 수 있으며, 군산시가 약관을 변경할 경우에는 적용일자 및 변경사유를 명시하여 그 적용일자 15일 전(회원에게 불리한 변경인 경우 30일 전)부터 공지하고, E-mail, 어플리케이션 Push 등으로 회원에게 개별 통지합니다. 단, 회원의 연락처 미기재, 변경 후 미수정 등으로 인하여 개별 통지가 어려운 경우에 한하여 본 항의 공지를 함으로써 개별 통지를 한 것으로 봅니다.<br>
                            4. 군산시가 제3항에 따라 변경 약관을 공지 또는 통지하면서, 약관의 변경에 동의한 것으로 간주한다는 내용을 공지 또는 통지하였음에도 회원이 명시적으로 약관 변경에 대한 거부의사를 표시하지 아니하면, 회원이 변경된 약관 내용에 동의한 것으로 봅니다. 회원이 변경된 약관 사항에 동의하지 않을 경우 서비스 이용을 중단하고 이용 계약을 해지할 수 있습니다.<br>
                            <br>
                            <b>제4조 (약관의 해석)</b><br>
                            본 약관에 명시되지 않은 사항에 대해서는, 정보통신망 이용촉진 및 정보보호 등에 관한 법률(이하 “정보통신망법”이라 합니다), 위치정보의 보호 및 이용 등에 관한 법률(이하 “위치정보법”이라 합니다), 전기통신 기본법, 전기통신사업법 등 관계법령 및 “유료서비스약관 등”, 군산시가 정한 서비스의 세부이용지침 등의 규정에 의합니다.<br>
                            <br>
                            <b>제5조 (이용 신청)</b><br>
                            1. 서비스에 가입하여 이용하고자 하는 자는 본 약관에 대해 동의하고 위치정보, 개인 기본 정보(이름, 휴대전화번호, 이메일, 성별, 생년월일)를 제공하여 가입절차를 진행합니다.<br>
                            2. 서비스에 가입하여 이용하고자 하는 자는 군산시에서 제공한 가입 신청서 양식에 따라 필요사항을 기재하여야 합니다. 회원 가입시 기재 항목은 필수 기재 항목과 선택 기재 항목으로 구분되어 있으며, 필수 기재 항목의 경우 반드시 입력을 하여야 합니다.<br>
                            3. 군산시는 서비스에 가입을 하여 이용하고자 하는 자에게 휴대폰 번호를 통한 인증 진행을 요구합니다. 이 경우 서비스에 가입을 하여 이용하고자 하는 자는 군산시가 제공하는 인증을 수행하여야 합니다.<br>
                            <br>
                            <b>제6조 (이용계약의 성립)</b><br>
                            1. 서비스의 이용계약은 회원이 되고자 하는 자(이하 “가입신청자”라고 합니다)의 제5조에 따른 이용 신청을 군산시가 승낙함으로써 체결됩니다.<br>
                            2. 19세 미만 아동의 서비스 가입 신청이나 이용은 제7조에 따라 제한될 수 있습니다.<br>
                            3. 회원이 본 약관에 동의함은 서비스와 관련하여 군산시에서 제공하거나 제공할 서비스 이용에 동의하는 것으로 봅니다.<br>
                            <br>
                            <b>제7조 (이용신청에 대한 승낙 유보 및 서비스 이용의 제한)</b><br>
                            1. 제5조에 의한 가입신청자의 신청에 대하여 군산시는 원칙적으로 서비스 이용을 승낙합니다. 단, 군산시는 다음 각호에 해당하는 신청에 대하여 그 사유가 해소될 때까지 승낙을 유보하거나, 승낙을 거부할 수 있습니다.<br>
                            1) 다른 사람의 명의를 사용하여 서비스 이용을 신청하거나, 인증을 허위로 진행한 경우<br>
                            2) 본 약관에 의하여 이전에 회원 자격을 상실한 적이 있는 경우. 단, 군산시의 재가입 승낙을 얻은 경우에는 예외로 함.<br>
                            3) 기술상 서비스 제공이 불가능하거나 기타 군산시의 귀책사유 없이 이용승낙이 곤란한 경우<br>
                            4) 회원가입 신청서 양식에 따른 등록 사항에 허위, 기재누락, 오기가 있는 경우<br>
                            5) 군산시가 정한 인증을 완료하지 않은 경우<br>
                            6) 14세 미만의 아동의 개인정보 처리에 대한 법정대리인의 동의가 없는 경우<br>
                            7) 군산시로부터 서비스 이용정지 등의 제재를 받은 회원이 그 제재기간 중에 이용계약을 임의로 해지하고 재이용 신청한 경우<br>
                            8) 사회의 안녕질서 또는 미풍양속을 저해하거나, 저해할 목적으로 신청한 경우<br>
                            9) 기타 군산시가 정한 이용신청 요건이 만족되지 않거나 위법 또는 부당한 이용신청임이 확인된 경우 또는 회원의 책임 있는 사유로 인하여 군산시가 승낙할 수 없는 경우<br>
                            2. 제1항에 따라 군산시가 회원가입 신청의 승낙을 유보하거나 거절한 경우 군산시는 가입신청자에게 승낙 유보의 사유, 승낙 가능시기 또는 승낙에 필요한 추가 요청정보 내지 자료 등 기타 승낙 유보, 거절과 관련된 사항을 서비스 화면에 게시하거나 E-mail 등을 통하여 통지합니다.<br>
                            <br>
                            <b>제8조 (서비스의 내용)</b><br>
                            군산시가 제공하는 서비스는 다음과 같습니다.<br>
                            - 자율주행 셔틀 서비스: 군산시가 사전에 정하고 회원이 선택하도록 한 출발지와 목적지를 회원 또는 회원이 지정한 승객이 자율주행 셔틀을 통하여 이동할 수 있도록 하는 서비스 및 이와 관련한 부가 서비스 일체<br>
                            <br>
                            <b>제9조 (이용개시)</b><br>
                            1. 군산시가 회원의 이용 신청을 승낙한 후부터 서비스를 개시합니다.<br>
                            2. 군산시의 업무상 또는 기술상의 장애로 인하여 서비스를 개시하지 못하는 경우에는 서비스 내에서 공지하거나 회원에게 이를 통지합니다.<br>
                            <br>
                            <b>제10조 (서비스 이용시간)</b><br>
                            1. 서비스의 이용시간은, 평일은 11:00시부터 18:00시까지, 공휴일 및 주말은 10:00시부터 18:00시까지로 주7일 운행을 원칙으로 합니다. 단, 군산시의 업무 또는 기술상의 이유로 서비스가 일시 중지될 수 있고, 또한 운영상의 목적으로 군산시가 정한 기간에는 서비스가 일시 중지될 수 있습니다. 이러한 경우 군산시는 사전 또는 사후에 이를 공지합니다.<br>
                            2. 군산시의 통제 불가능한 사유로 인한 서비스 중단의 경우 사전통지가 불가능하며, 타인의 고의, 과실로 인한 시스템중단 등의 경우에는 통보하지 아니합니다.<br>
                            <br>
                            <b>제11조 (서비스의 변경 및 중단)</b><br>
                            1. 변경될 서비스의 내용 및 제공일자를 제17조에서 정한 방법으로 회원에게 통지하고 서비스를 변경하여 제공할 수 있습니다.<br>
                            2. 군산시는 다음 각 호에 해당하는 경우 서비스의 전부 또는 일부를 제한하거나 중단할 수 있습니다.<br>
                            1) 서비스의 보수 등 공사로 인해 부득이한 경우<br>
                            2) 회원이 본 약관의 규정을 위반한 경우<br>
                            3) 정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 서비스의 이용에 지장이 있는 경우<br>
                            4) 서비스 제공을 위한 제3자와의 계약 종료 또는 경영상의 판단 등 군산시의 제반 사정으로 서비스를 유지할 수 없는 경우<br>
                            5) 기타 천재지변, 국가비상사태 등 불가항력적 사유가 있는 경우<br>
                            3. 제2항에 의한 서비스 중단의 경우에는 군산시가 제17조에서 정한 방법으로 회원에게 통지합니다. 단, 군산시가 통제할 수 없는 사유로 인해 서비스의 중단으로 인하여 사전 통지가 불가능한 경우에는 그 사유가 종료된 후 즉시 통지합니다.<br>
                            4. 군산시는 무료로 제공되는 서비스의 변경 및 중단으로 발생하는 문제에 대해서 군산시에 귀책사유가 없는 한 책임을 부담하지 않습니다.<br>
                            <br>
                            <b>제12조 (정보의 제공 및 광고의 게재)</b><br>
                            1. 군산시는 서비스를 운영함에 있어서 서비스 관련 각종 정보를 서비스 화면에 게재하거나, E-mail, 어플리케이션 Push 등의 방법으로 회원에게 제공할 수 있습니다.<br>
                            2. 군산시는 서비스를 운영함에 있어 군산시 또는 제휴사의 각종 광고를 서비스 화면에 게재하거나 회원의 동의를 얻어 E-mail, 어플리케이션 Push 등의 방법으로 회원에게 제공할 수 있습니다.<br>
                            3. 회원이 서비스상에 게재되어 있는 광고를 이용하거나 서비스를 통한 광고주의 판촉활동에 참여하는 등의 방법으로 교신 또는 거래를 하는 것은 전적으로 회원과 광고주 사이의 문제입니다. 회원과 광고주 사이의 분쟁, 기타 문제가 발생하는 경우 회원과 광고주가 직접 해결하여야 하며, 이와 관련하여 군산시는 귀책사유가 없는 한 책임을 부담하지 않습니다.<br>
                            <br>
                            <b>제13조 (게시물 또는 내용물의 삭제)</b><br>
                            1. 군산시는 회원이 군산시의 서비스와 관련하여 게시하거나 전달하는 내용물(회원간 전달 포함)이 다음 각 호의 경우에 해당한다고 판단되는 경우, 즉시 내용물의 삭제를 회원에게 요청하거나 또는 사전통지 없이 군산시가 게시, 전달 등을 중단할 수 있으며, 이에 대해 군산시는 귀책사유가 없는 한 책임을 부담하지 않습니다.<br>
                            1) 군산시, 다른 회원 또는 제3자를 비방하거나 명예를 손상시키는 내용인 경우<br>
                            2) 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형 등을 유표하거나 링크시키는 경우<br>
                            3) 범죄적 행위(불법복제, 해킹조장 등 포함)에 결부된다고 인정되는 경우<br>
                            4) 군산시 또는 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우<br>
                            5) 제2항 세부 이용지침에 따른 게시기간을 초과한 경우<br>
                            6) 불필요하거나 승인되지 않은 광고, 판촉물을 게재하는 경우<br>
                            7) 기타 관계 법령 및 군산시의 지침 등에 위반된다고 판단되는 경우<br>
                            2. 군산시는 게시물에 관련된 세부 이용지침을 별도로 정하여 시행할 수 있으며, 회원은 그 지침에 따라 각종 게시물(회원간 전달 포함)을 등록하거나 삭제하여야 합니다.<br>
                            <br>
                            <b>제14조 (게시물의 저작권)</b><br>
                            1. 회원이 서비스 내에 게시한 게시물(회원간 전달 포함)의 저작권은 회원이 보유하며, 군산시는 서비스의 활성화를 위하여 이를 게시, 기타 활용할 수 있는 권리를 가집니다.<br>
                            2. 군산시는 서비스 내에 게시한 게시물(회원간 전달 포함)을 회원의 동의 없이 제1항 후단 외에 다른 목적으로 사용할 수 없습니다.<br>
                            3. 군산시는 회원이 서비스 내에서 게시한 게시물이 타인의 저작권, 기타 권리를 침해하더라도 군산시의 귀책 사유가 없는 한 이에 대한 민·형사상의 책임을 부담하지 않습니다. 만일 회원이 타인의 저작권 또는 기타 권리를 침해하였음을 이유로 군산시가 귀책사유 없이 타인으로부터 손해배상청구 등 이의 제기를 받은 경우 회원은 군산시를 면책시켜야 하며, 회원은 그로 인해 군산시에 발생한 모든 손해를 부담하여야 합니다.<br>
                            4. 군산시는 회원이 이용계약을 해지하거나 본 약관에 의한 적법한 사유로 이용 계약이 해지된 경우, 해당 회원이 게시하였던 게시물을 삭제할 수 있습니다.<br>
                            5. 군산시가 이용고객에게 제공하는 각종 서비스에 대한 저작권을 포함한 일체의 권리는 군산시에 귀속됩니다.<br>
                            6. 회원은 서비스를 이용하여 얻은 정보를 가공, 판매하는 행위 등 서비스에 게재된 타인의 자료를 영리 목적으로 이용하거나 제3자에게 이용하게 할 수 없으며, 게시물에 대한 저작권 침해는 관계 법령의 적용을 받습니다.<br>
                            <br>
                            <b>제15조 (군산시의 의무)</b><br>
                            1. 서비스 제공과 관련하여 취득한 회원의 개인정보 또는 위치정보(이하 통칭할 경우 “개인정보 등”)를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다. 단, 관계법령에 의한 수사상의 목적으로 관계기관으로부터 요구받은 경우 등 법률의 규정에 따른 적법한 절차에 의한 경우에는 그러하지 않습니다.<br>
                            2. 군산시는 업무와 관련하여 회원의 사전 동의 없이 회원 전체 또는 일부의 개인정보 등을 특정 회원의 정보를 구별할 수 없는 통계자료로 작성하여 이를 사용할 수 있고, 이를 위하여 회원의 컴퓨터에 쿠키를 전송할 수 있습니다. 다만, 이 경우 회원은 쿠키의 수신을 거부하거나 쿠키의 수신에 대하여 경고하도록 사용하는 기기의 설정을 변경할 수 있으나, 이 경우 쿠키의 설정 변경으로 인해 군산시의 귀책사유 없이 서비스 이용이 변경될 수 있습니다.<br>
                            3. 군산시는 서비스와 관련하여 회원이 접수한 불만사항이 정당하다고 객관적으로 인정되는 경우 이를 신속하게 처리하여야 하며, 신속한 처리가 곤란한 경우 그 사유와 처리 일정을 서비스 화면에 게재하거나 E-mail, 어플리케이션 Push 등을 통하여 회원에게 통지합니다.<br>
                            4. 군산시가 제공하는 서비스로 인하여 회원에게 손해가 발생한 경우 그러한 손해가 군산시의 귀책사유에 의하여 발생한 경우에 한하여 군산시에서 책임을 부담합니다.<br>
                            5. 군산시는 정보통신망법, 위치정보보호법, 통신비밀보호법, 전기통신사업법 등 서비스의 운영, 유지와 관련된 법규를 준수합니다.<br>
                            <br>
                            <b>제16조 (회원의 의무)</b><br>
                            1. 회원은 회원가입 신청 또는 회원정보 변경시, 실명으로 모든 사항을 현재의 사실에 근거하여 작성하고 완전한 정보(이하 “등록정보”라 합니다)를 제공하여야 하며, 허위 또는 타인의 정보를 등록할 경우 일체의 권리를 주장할 수 없습니다. 또한 회원은 등록정보에 변동사항이 발생할 경우 즉시 갱신하여야 원활한 서비스를 제공받으실 수 있습니다.<br>
                            2. 서비스를 이용할 때 다음 각 호의 행위를 하여서는 아니 됩니다.<br>
                            1) 이용 신청 또는 변경 시 허위 사실을 기재하거나, 제3자의 정보를 도용, 부정하게 사용하거나, 이동전화 명의자의 허락 없이 실사용자가 “SMS 인증”, 범용공인인증 또는 신용카드인증 등을 수행하는 행위<br>
                            2) 군산시의 서비스 정보를 이용하여 얻은 정보를 군산시의 사전 승낙 없이 복제 또는 유통시키거나 상업적으로 이용하는 행위<br>
                            3) 타인의 명예를 손상시키거나 불이익을 주는 행위<br>
                            4) 서비스 내에 음란물(음란한 영상 및 정보 등 포함)을 게재하거나 음란사이트를 연결(링크)하는 행위<br>
                            5) 군산시 또는 제3자의 저작권 등 기타 권리를 침해하는 행위<br>
                            6) 공공질서 및 미풍양속에 위반되는 내용의 정보, 문자, 도형, 음성 등을 타인에게 유포하거나 링크시키는 행위<br>
                            7) 서비스와 관련된 설비의 오작동이나 정보 등의 파괴 및 혼란을 유발시킬 수 있는 컴퓨터 바이러스 등 감염 자료를 등록 또는 유포하는 행위<br>
                            8) 서비스의 안정적 운영을 저해할 수 있는 정보 및 수신자의 명시적인 수신거부의사에 반하여 광고성 정보 또는 스팸메일(Spam Mail)을 전송하는 행위<br>
                            9) 불법프로그램 또는 변조된 프로그램 등을 사용하여 정상적인 서비스 제공을 방해하는 행위<br>
                            10) 이용의사 없이 반복적인 호출 및 취소를 통해 군산시의 서비스 제공을 방해하는 행위<br>
                            11) 타인으로 가장하는 행위 및 타인과의 관계를 허위로 명시하는 행위<br>
                            12) 다른 회원의 개인정보를 수집, 저장, 공개하는 행위<br>
                            13) 자기 또는 타인에게 재산상의 이익을 주거나 타인에게 손해를 가할 목적으로 허위의 정보를 유통시키는 행위<br>
                            14) 서비스에 게시된 정보를 변경하는 행위<br>
                            15) 관련 법령에 의하여 그 전송 또는 게시가 금지되는 정보(컴퓨터 프로그램 포함)를 전송 또는 게시하는 행위<br>
                            16) 군산시의 직원이나 운영자를 가장하거나 사칭하는 행위<br>
                            17) 타인의 명의를 도용하여 글을 게시하거나 E-mail을 발송하는 행위<br>
                            18) 컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해, 파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파일, 프로그램을 포함하고 있는 자료를 게시하거나 E-mail로 발송하는 행위<br>
                            19) 본 서비스를 통해 얻은 정보를 군산시의 사전 승낙 없이 서비스 이용 외의 목적으로 복제하거나, 이를 출판 및 방송 등에 사용하거나, 제3자에게 제공하는 행위<br>
                            20) 서비스 운영에 위해를 가하거나 고의 또는 과실로 방해를 가하는 행위<br>
                            21) 다른 이용자를 희롱 또는 위협하거나, 특정 이용자에게 지속적으로 고통 또는 불편을 줄 우려가 있는 행위<br>
                            22) 기타 불법적이거나 부당한 행위<br>
                            3. 회원은 관계법령, 본 약관의 규정, 이용안내 및 서비스 상에 공지한 주의사항, 군산시가 통지하는 사항 등을 준수하여야 합니다.<br>
                            4. 회원은 군산시에서 공식적으로 인정한 경우를 제외하고는 서비스를 이용하여 상품을 판매하는 영업 활동을 할 수 없으며 특히 해킹, 광고를 통한 수익, 음란사이트를 통한 상업행위, 상용소프트웨어 불법배포 등을 할 수 없습니다. 이를 위반하여 발생한 영업 활동의 결과 및 손실, 관계기관에 의한 구속 등 법적 조치 등은 군산시와는 무관하며, 회원은 이와 같은 행위와 관련하여 군산시에 대하여 손해배상의무를 집니다.<br>
                            5. 회원이 제16조 2항에 명시된 행위를 한 경우에 군산시는 서비스의 일부 또는 전부에 대한 이용제한, 이용계약의 해지 등을 할 수 있으며, 군산시에 손해가 발생한 경우에는 손해배상의 청구 등의 조치를 할 수 있습니다.<br>
                            6. 군산시가 제16조 5항에 정한 조치를 할 경우 군산시는 사전에 회원에게 서비스 내 게재 또는 E-mail, 어플리케이션 Push 등으로 통보하며, 회원의 연락이 두절되거나 긴급을 요하는 것과 같이 부득이한 경우, 선 조치 후 사후 통보할 수 있습니다.<br>
                            7. 회원은 제16조 5항에 의한 군산시의 조치에 대하여 이의신청을 할 수 있습니다.<br>
                            8. 제16조 5항에 의하여 군산시가 회원과의 이용계약을 해지하더라도, 해지 이전에 이미 체결된 계약의 완결에 관해서는 본 약관이 그대로 적용됩니다.<br>
                            9. 제16조 5항에서 정한 바에 따라 이용계약이 종료될 시에는 군산시는 별도 통지 없이 해당 회원과 관련된 거래를 취소할 수 있고, 회원이 서비스의 결제를 신용카드로 결제한 경우에는 그 신용카드매출을 취소할 수 있습니다.<br>
                            10. 제16조 5항에서 정한 바에 따라 이용계약이 종료되는 경우 회원의 재이용신청에 대하여 군산시는 그 승낙을 거절할 수 있습니다.<br>
                            <br>
                            <b>제17조 (회원을 대상으로 하는 통지)</b><br>
                            회원을 대상으로 하는 통지의 경우 군산시는 서비스 내에 게재하거나 회원이 등록한 E-mail 주소 또는 SMS, 어플리케이션 Push 등으로 할 수 있습니다. 다만, 군산시는 불특정 다수 회원에게 통지를 하는 경우 서비스 게시판 내 게시 등의 방법을 활용할 수 있습니다.<br>
                            <br>
                            <b>제18조 (개인정보 등의 변경 및 보호)</b><br>
                            1. 회원은 이용신청 시 기재한 사항이 변경되었을 경우에는 즉시 변경사항을 최신의 정보로 수정하여야 합니다. 단, 군산시가 정한 정보 항목은 군산시의 승인을 받아 수정할 수 있습니다.<br>
                            2. 수정하지 않은 정보로 인하여 발생하는 손해는 당해 회원이 부담하며, 군산시는 이에 대하여 귀책사유가 없는 한 책임을 지지 않습니다.<br>
                            3. 군산시는 회원의 정보를 서비스를 제공하기 위한 목적 이외의 용도로 사용하거나 회원의 동의 없이 제3자에게 제공하지 않습니다. 단, 다음의 경우는 예외로 합니다.<br>
                            1) 서비스 제공에 관한 계약을 이행하기 위한 것으로 판매자에게 거래 내역, 정산 내역 제공 등에 필요한 최소한의 회원정보(성명, 연락처 등)를 제공하는 경우<br>
                            2) 법령에서 회원의 개인정보의 이용과 제3자에 대한 정보제공을 허용하고 있는 경우<br>
                            4. 군산시는 관련법령이 정하는 바에 따라서 회원 등록정보를 포함한 회원의 개인정보 등을 보호하기 위하여 노력합니다. 회원의 개인정보 등의 보호에 관해서는 관련 법령 및 군산시가 정하는 개인정보처리방침에 정한 바에 의합니다.<br>
                            5. 군산시는 수집된 개인정보 등의 취급 및 관리 등의 업무를 스스로 수행함을 원칙으로 하나, 필요한 경우 회원의 동의를 받거나 통지를 한 후 위 업무의 일부 또는 전부를 군산시가 선정한 군산시에 위탁할 수 있습니다.<br>
                            <br>
                            <b>제19조 (계약해지 및 이용제한)</b><br>
                            1. 회원은 다음 각 호에서 정한 바에 따라 이용계약을 해지할 수 있습니다.<br>
                            1) 회원은 언제든지 군산시에 이용계약 해지의 의사를 통지함으로써 이용계약을 해지할 수 잇습니다. 단, 해지의사를 통지하기 전에 현재 진행 중인 모든 유료서비스의 거래를 완료하거나 철회 또는 취소하여야 하며, 군산시는 귀책사유가 없는 한 해당 유료서비스 거래에 관하여 책임을 부담하지 않습니다. 이 경우 관련법령 및 군산시가 정하는 “개인정보 취급방침”에 따라 개인정보 등이 삭제 등 관리됩니다.<br>
                            2) 회원탈퇴로 인해 발생할 수 있는 사항에 대하여 군산시는 귀책사유가 없는 한 책임을 부담하지 아니하며, 이용계약이 종료되면 군산시가 이용계약에 기초하여 회원에게 부가적으로 제공한 혜택이 함께 종료되고, 군산시는 이에 대해 별도로 보상하지 않습니다.<br>
                            2. 군산시는 회원이 제16조에 규정한 회원의 의무를 이행하지 않을 경우, 즉시 이용계약을 해지하거나 또는 서비스 이용 중단 조치를 취할 수 있습니다.<br>
                            3. 군산시는 회원이 이용계약을 체결한 이후라도 회원의 자격에 제한이 있는 때에는 서비스 이용을 제한할 수 있습니다.<br>
                            4. 군산시는 회원 가입 후 3개월 동안 서비스 사용 이력이 없는 회원에 대하여는, 일정 기간을 정하여 사용의사를 묻고 고지한 바에 따라 계약을 종료할 수 있습니다.<br>
                            5. 제19조 2항 내지 4항의 군산시 조치에 대하여 회원은 군산시가 정한 절차에 따라 이의신청을 할 수 있습니다.<br>
                            6. 제19조 5항의 이의가 정당하다고 군산시가 인정하는 경우, 군산시는 즉시 서비스 이용을 재개합니다.<br>
                            <br>
                            <b>제20조 (양도 금지)</b><br>
                            회원은 서비스의 이용약관, 기타 이용 계약상 지위를 타인에게 양도, 증여, 담보 제공할 수 없습니다.<br>
                            <br>
                            <b>제21조 (손해배상)</b><br>
                            1. 회원이 본 약관의 규정을 위반함으로 인하여 군산시에 손해가 발생하게 되는 경우, 본 약관을 위반한 회원은 군산시에 발생하는 손해를 배상하여야 합니다.<br>
                            2. 회원이 서비스를 이용함에 있어 행한 불법행위나 본 약관 위반행위로 인하여 군산시가 당해 회원 이외의 제3자로부터 손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 회원은 자신의 책임과 비용으로 군산시를 면책시켜야 하며, 당해 회원은 그로 인하여 군산시에 발생한 손해를 배상하여야 합니다.<br>
                            3. 군산시의 고의나 과실에 의하여 회원에게 손해가 발생한 경우 그러한 손해에 대하여는 군산시에서 책임을 부담하여야 합니다.<br>
                            <br>
                            <b>제22조 (면책사항)</b><br>
                            1. 군산시는 다음 각 호의 경우 이로 인하여 발생된 손해에 대해서는 책임을 부담하지 않습니다.<br>
                            1) 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우<br>
                            2) 기간통신사업자가 전기통신 서비스를 중지하거나 정상적으로 제공하지 아니한 경우<br>
                            3) 서비스용 설비의 보수, 교체, 정기점검, 공사 등 부득이한 사유로 인한 경우<br>
                            4) 회원의 귀책사유로 인한 서비스 이용의 장애 또는 손해가 발생된 경우<br>
                            5) 이용자의 컴퓨터 오류에 의해 손해가 발생한 경우, 또는 회원이 신상정보 및 전자우편 주소 등을 부실하게 기재하여 손해가 발생한 경우<br>
                            6) 기타 군산시의 고의,과실이 없는 경우<br>
                            2. 군산시는 회원이 서비스를 이용하여 기대하는 수익을 얻지 못하거나 상실한 것에 대하여는 책임을 지지 않으며, 서비스를 통하여 얻은 자료, 서비스 이용시 타회원으로 인해 입게 된 피해 등에 대하여도 책임을 지지 않습니다.<br>
                            3. 군산시는 회원이 서비스에 게재한 각종 정보, 자료, 사실의 신뢰도, 정확성 등 내용에 대하여 보증하지 않으며, 이로 인하여 발생한 손해에 대해서는 책임을 지지 않습니다.<br>
                            4. 군산시는 회원 상호간 또는 회원과 제3자 상호간에 서비스를 매개로 발생한 분쟁에 대해서는 개입할 의무가 없으며, 이로 인한 손해를 배상할 책임도 없습니다.<br>
                            5. 군산시는 서비스의 내용 및 서비스에서 제공되는 정보의 정확성을 보증하지 않습니다.<br>
                            6. 군산시는 대한민국 법에서 정한 규율을 존중하며, 정보통신법과 청소년보호법을 비롯한 모든 법률을 위반하는 게시물을 올리는 것을 절대 허용하지 않으며, 이에 관하여 군산시는 일체의 책임을 지지 않습니다.<br>
                            7. 군산시는 회원이 군산시 서비스를 이용함으로써 회원 본인 또는 제3자에게 직/간접적으로 영향을 미치게 되는 모든 피해와 법적 문제에 대하여 책임을 지지 않습니다.<br>
                            <br>
                            <b>제23조 (분쟁의 해결 및 관할법원)</b><br>
                            1. 서비스 이용과 관련하여 군산시와 회원 사이에 분쟁이 발생한 경우, 군산시와 회원은 분쟁의 해결을 위해 성실히 협의합니다.<br>
                            2. 군산시와 회원 사이에 제기된 소송은 대한민국법을 준거법으로 합니다.<br>
                            3. 군산시와 회원 사이에 발생한 분쟁에 관한 소송의 관할법원은 민사소송법에 따라 정합니다.<br>
                            <br>
                            <b>제24조 (약관 외 준칙)</b><br>
                            1. 본 약관은 군산시가 제공하는 개별서비스에 관한 이용안내(별첨 서비스 제공 이용약관)와 함께 적용합니다.<br>
                            2. 본 약관에 명시되지 아니한 사항에 대해서는 별도의 세부 약관, 군산시의 공지, 이용안내, 서비스 별 안내, 관계법령 및 상관행에 따릅니다.<br>
                            <br>
                            부칙<br>
                            본 약관은 2020년 09월 01일부터 적용됩니다.<br>
                        </v-card-text>
                    </v-card>
                </v-dialog>

                <v-dialog v-model="privacyDialog" scrollable max-width="320px">
                    <v-card flat tile color="#FFF">
                        <v-card-title class="pa-0" style="height: 30px;">
                            <v-spacer></v-spacer>
                            <v-btn icon @click.native="privacyDialog = false" width="16px" height="16px" style="padding-right: 20px; padding-top: 5px;">
                                <v-img src="../../assets/closing-btn.svg"></v-img>
                            </v-btn>
                        </v-card-title>
                        <v-card-text class="pa-3 pt-0 privacy_content">
                            <span class="privacy_title">개인정보 처리방침</span><br>
                            <br>
                            온리원 고군산 자율주행 셔틀 서비스 개인정보 처리방침<br>
                            <br>
                            군산시는 군산시가 제공하는 관련 제반 서비스인 온리원 고군산 자율주행 셔틀 서비스(이하 “서비스”라 한다)의 이용과 관련하여 서비스 이용자(이하 “회원”라 한다)의 개인정보를 중요시하고, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법, 통신비밀보호법, 전기통신사업법 등 정보통신서비스 제공자가 준수하여야 할 관련 법령상의 개인정보보호 규정을 준수하며, 관련 법령에 의거한 개인정보처리방침을 정하여 회원 권익 보호에 최선을 다하고 있습니다. 군산시는 개인정보 처리방침을 통하여 회원께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다. <br>
                            <br>
                            <b>제1조 (수집하는 개인정보의 항목 및 수집방법)</b><br>
                            1. 수집하는 개인정보의 항목 <br>
                            군산시는 회원가입(또는 서비스 가입), 원활한 고객상담, 각종 서비스의 제공을 위해 서비스 최초 이용 시 다음과 같은 개인정보를 수집하고 있습니다.<br>
                            2. 개인정보: 회원의 이름, 생년월일, 아이디, 비밀번호, 이메일 주소, 휴대전화번호, 기타 아래 서비스 이용과정에서 수집되는 정보 및 회원이 서비스 이용을 위해 자발적으로 입력하는 정보 등<br>
                            3. 서비스 이용과정이나 처리 과정에서 아래와 같은 정보들이 자동으로 생성되어 수집될 수 있습니다.<br>
                            : IP Address, 방문 일시, 서비스 이용 기록, 쿠키, 접속 로그, 불량 이용 기록, 앱 설치정보,<br>
                            네트워크 위치정보 등<br>
                            4. 개인정보 수집방법<br>
                            군산시는 다음과 같은 방법으로 개인정보를 수집합니다.<br>
                            1) 홈페이지 또는 어플리케이션 상의 서비스 프로그램 실행 또는 사용 과정에서 수집<br>
                            2) 생성정보 수집 툴(쿠키를 포함)을 통한 수집<br>
                            3) 사용 중 회원의 자발적 제공을 통한 수집<br>
                            <br>
                            <b>제2조 (개인정보의 처리 목적)</b><br>
                            군산시는 회원의 동의가 있거나 법령의 규정에 의한 경우를 제외하고는 본 조에서 고지한 범위를 넘어 회원의 개인정보를 활용하지 않습니다. 군산시는 수집한 개인정보를 다음과 같은 목적으로 이용합니다.<br>
                            1. 서비스 제공 및 운영<br>
                            회원이 가입한 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 콘텐츠 제공, 차량사고 발생 시 사고처리, 주요 공지사항 등 공지, 군산시의 약관 또는 이용정책의 위반행위 적발을 위한 기록 조회<br>
                            2. 회원관리<br>
                            회원식별, 본인확인, 개인식별, 이용이 제한된 회원(서비스 이용약관에 따라 이용 제한된 회원)의 부정이용 방지와 비인가 사용방지, 가입의사 확인 및 가입회수 제한, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달, 만 14세 미만 아동의 개인정보 처리시 법정대리인의 동의여부 확인, 최신 정보 전달, 서비스의 유효성 확인, 접속빈도 파악, 회원의 서비스이용에 대한 통계 확인 및 파악<br>
                            3. (선택적) 신규 서비스 개발 및 마케팅 · 광고에의 활용<br>
                            신규 서비스 개발 및 이벤트 관련 광고성 정보안내, 이벤트 경품배송, 고객별 통계분석자료 활용, 시장조사<br>
                            4. 사고발생시 원인 규명 및 처리를 위한 수집 및 이용<br>
                            <br>
                            <b>제3조 (개인정보의 처리 및 보유기간)</b><br>
                            1. 군산시는 원칙적으로 회원의 개인정보를 수집한 때로부터 회원 탈퇴 시까지의 기간에 한하여 개인정보를 보유 및 이용하며, 개인정보 수집 및 이용목적이 달성된 경우 또는 회원 탈퇴 시에는 해당 정보를 지체없이 파기합니다. 단, 군산시 내부방침이나 관계법령의 규정에 의하여 보존할 필요가 있는 경우에는 일정 기간 동안 개인정보를 보관할 수 있으며, 이 경우 군산시는 보관하는 정보를 그 보관의 목적으로만 이용합니다.<br>
                            2. 구체적인 개인정보 처리 및 보유기간은 다음과 같습니다.<br>
                            1) 계약 또는 청약철회 등에 관한 기록: 5년(전자상거래 등에서의 소비자보호에 관한 법률)<br>
                            2) 대금결제 및 재화 등의 공급에 관한 기록: 5년 (전자상거래 등에서의 소비자보호에 관한<br>
                            법률)<br>
                            3) 소비자의 불만 또는 분쟁처리에 관한 기록: 3년 (전자상거래 등에서의 소비자보호에 관한법률)<br>
                            4) 신용정보의 수집/처리 및 이용 등에 관한 기록: 3년 (신용정보의 이용 및 보호에 관한 법률)<br>
                            5) 서비스이용기록, 접속로그, 접속IP정보: 3개월 (통신비밀보호법)<br>
                            6) 관계 법령 위반에 따른 수사·조사 등이 진행중인 경우 : 해당 수사·조사 등 종료시까지<br>
                            7) 채권·채무관계가 잔존하는 경우 : 해당 채권·채무관계 정산시까지<br>
                            ※ '개인정보 유효기간제’에 따라 1년간 서비스를 이용하지 않은 회원의 개인정보를 별도로 분리 보관하여 관리하고 있습니다.<br>
                            <br>
                            <b>제4조 (개인정보의 제3자 제공)</b><br>
                            1. 군산시는 본 서비스 이용 중 수집된 이용자의 정보를 정보주체의 동의, 법률의 특별한 규정이 있는 경우에만 제3자에게 제공합니다.<br>
                            2. 군산시는 업무제휴 등의 목적으로 다음과 같이 개인정보를 제3자에게 제공하고 있습니다. 다만, 이용자는 개인정보 제공동의를 거부할 권리가 있으며, 미동의시 서비스 이행을 위한 업무처리가 불가능하여 서비스 제한을 받으실 수 있습니다.<br>
                            <br>
                            <b>제5조 (개인정보 파기절차 및 방법)</b><br>
                            회원의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기되며, 법률에 의해 보유되는 경우가 아니고서는 이외의 다른 목적으로도 이용되지 않습니다. 군산시의 개인정보 파기절차 및 방법은 다음과 같습니다.<br>
                            1. 파기절차<br>
                            회원이 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유(보유 및 이용기간 참조)에 따라 일정 기간 저장된 후 파기됩니다.<br>
                            2. 파기방법<br>
                            1) 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.<br>
                            2) 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.<br>
                            <br>
                            <b>제6조 (개인정보처리의 위탁)</b><br>
                            1. 군산시는 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리 업무를 운영사에 위탁하고 있습니다.<br>
                            1) 온리원 고군산 자율주행 셔틀 서비스 운영<br>
                            - 위탁받는 자(수탁자) : ㈜스프링클라우드<br>
                            - 위탁하는 업무의 내용 : 서비스 운영 및 관리<br>
                            - 개인정보 보유 및 이용기간: 회원 탈퇴 또는 위탁계약 종료시까지<br>
                            2. 군산시는 위탁계약 체결시 개인정보 보호법 제25조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적·관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리·감독, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독하고 있습니다.<br>
                            3. 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체없이 본 개인정보처리방침을 통하여 공개하도록 하겠습니다.<br>
                            <br>
                            <b>제7조 (회원 및 법정대리인의 권리, 의무와 그 행사방법)</b><br>
                            1. 회원 및 법정대리인은 언제든지 등록되어 있는 자신의 개인정보를 열람하거나 수정할 수 있으며, 군산시의 개인정보의 처리에 동의하지 않는 경우 동의를 거부하거나 가입해지(회원탈퇴)를 요청할 수 있습니다. 단, 개인정보에서 이름, 미수금 발생 이력 등 서비스 운영을 위해 확인이 필요한 정보를 변경할 경우에는 군산시의 승인이 이루어질 때까지 서비스 이용이 제한될 수 있습니다.<br>
                            2. 회원의 개인정보 조회 및 수정을 위해서는 "개인정보변경"(또는 "회원정보수정" 등)을, 가입해지(동의철회)를 위해서는 "회원탈퇴"를, 각 클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정 또는 탈퇴가 가능합니다. 혹은 개인정보관리책임자에게 서면 또는 이메일로 연락하시면 지체 없이 조치하겠습니다.<br>
                            3. 회원 또는 법정대리인이 개인정보의 오류에 대한 정정을 요청하신 경우에는, 군산시는 당해 정정을 완료하기 전까지 당해 개인정보를 이용하지 않습니다.<br>
                            4. 서비스에 가입할 수 있는 자는 만 14세 이상이며, 개인정보의 수집∙이용에 법정 대리인의 동의가 필요한 만 14세 미만 아동의 개인정보는 원칙적으로 수집하지 않습니다.<br>
                            <br>
                            <b>제8조 (개인정보 자동 수집 장치의 설치/운영 및 그 거부에 관한 사항)</b><br>
                            1. 군산시는 고객님의 정보를 수시로 저장하고 찾아내는 ‘쿠키(cookie)’ 등을 운용합니다. 쿠키란 군산시의 홈페이지 및 어플리케이션을 운영하는데 이용되는 서버가 귀하의 브라우저에 보내는 아주 작은 텍스트 파일로서 귀하의 컴퓨터 하드디스크에 저장됩니다.<br>
                            2. 쿠키 등 사용 목적<br>
                            군산시의 홈페이지 및 어플리케이션 접속빈도 및 방문시간 분석, 고객의 관심분야 파악 및 분석, 각종 이벤트 참여 및 방문횟수 파악 등을 통한 타겟 마케팅 및 개인 맞춤 서비스 제공을 위해 쿠키 등을 사용합니다.<br>
                            3. 쿠키의 설치/운영 및 거부<br>
                            회원은 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 웹브라우저 또는 휴대전화기의 환경에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다. 다만, 쿠키의 저장을 거부할 경우에는 로그인이 필요한 일부 서비스는 이용에 어려움이 있을 수 있습니다.<br>
                            <br>
                            <b>제9조 (개인정보의 안전성 확보조치)</b><br>
                            군산시는 회원들의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 대책을 강구하고 있습니다. 단, 회원 본인의 부주의나 인터넷상의 문제로 ID, 비밀번호 등 개인정보가 유출되어 발생한 문제에 대해 군산시는 일체의 책임을 지지 않습니다.<br>
                            1. 기술적 조치 - 해킹 등에 대비한 대책<br>
                            1) 군산시는 해킹이나 컴퓨터 바이러스 등에 의해 회원의 개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을 다하고 있습니다.<br>
                            2) 개인정보의 훼손에 대비해서 자료를 백업하고 있고, 최신 보안 패치와 방화벽을 이용하여 회원들의 개인정보나 자료가 누출되거나 손상되지 않도록 방지하고 있습니다.<br>
                            3) 그리고 기타 시스템적으로 보안성을 확보하기 위한 가능한 모든 기술적 장치를 갖추려 노력하고 있습니다.<br>
                            2. 관리적 조치 - 취급 직원의 최소화 및 교육<br>
                            군산시의 개인정보관련 취급 직원은 담당자에 한정시키고 있고 이를 위한 별도의 비밀번호를 부여하여 정기적으로 갱신하고 있으며, 담당자에 대한 수시 교육을 통하여 개인정보처리방침의 준수를 항상 강조하고 있습니다.<br>
                            3. 물리적 조치<br>
                            전산실, 자료보관실 등의 접근을 통제하고 있습니다.<br>
                            <br>
                            <b>제10조 (개인정보 보호책임자에 관한 사항)</b><br>
                            1. 귀하께서는 군산시의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자 혹은 담당부서로 신고하실 수 있습니다. 군산시는 회원들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.<br>
                            2. 개인정보 관리책임자<br>
                            이름 : 이대석<br>
                            소속 : 마케팅 사업본부<br>
                            직위 : 팀장<br>
                            메일 : dslee@aspringcloud.com<br>
                            기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.<br>
                            <br>
                            개인정보침해신고센터<br>(http://www.118.or.kr / 국번없이 118)<br>
                            개인정보 분쟁조정위원회<br>(http://www.kopico.go.kr / 국번없이 1833-6972)<br>
                            대검찰청 사이버범죄수사단<br>(http://www.spo.go.kr / 02-3480-200 )<br>
                            경찰청 사이버테러대응센터<br>(http://cyberbureau.police.go.kr / 국번없이 182)<br>
                            <br>
                            <b>제11조 (개인정보 처리방침의 변경에 관한 사항)</b><br>
                            1. 군산시는 개인정보 처리방침을 개정하는 경우 개정이유 및 개정내용에 관하여 E-mail, SNS, App Push 등으로 회원에게 개별 통지할 것입니다. 군산시는 개인정보 처리방침을 변경하는 경우 버전번호 등을 부여하여 변경된 사항을 회원께서 쉽게 알아보실 수 있도록 하고 있습니다. 본 개인정보처리방침 버전은 v1.0 이며, 2020년 09월 01일부터 시행됩니다.<br>
                        </v-card-text>
                    </v-card>
                </v-dialog>

                <v-dialog v-model="marketingDialog" scrollable max-width="320px">
                    <v-card flat tile color="#FFF">
                        <v-card-title class="pa-0" style="height: 30px;">
                            <v-spacer></v-spacer>
                            <v-btn icon @click.native="marketingDialog = false" width="16px" height="16px" style="padding-right: 20px; padding-top: 5px;">
                                <v-img src="../../assets/closing-btn.svg"></v-img>
                            </v-btn>
                        </v-card-title>
                        <v-card-text class="pa-3 pt-0 privacy_content">
                            <span class="privacy_title">마케팅 정보 수신 동의</span><br>
                            <br>
                            <b>제1조 (마케팅 정보 수신 동의)</b><br>
                            군산시는 개인정보보호법 및 정보통신망이용촉진및정보보호등에관한법률 등 관계법령에 따라 광고성정보를 전송하기 위해 수신자의 사전 수신동의를 받고 있으며, 광고성정보 수신자의 수신동의여부를 정기적으로 확인합니다.<br>
                            <br>
                            <b>제2조 (전송방법)</b><br>
                            이용자의 모바일 App Push, 핸드폰 문자메시지(SMS), Email 등을 통해 전달될 수 있습니다.<br>
                            <br>
                            <b>제3조 (전송내용)</b><br>
                            발송되는 마케팅 정보는 수신자에게 회사와 관련하여 제공하는 혜택(포인트, 쿠폰 등) 정보, 각종 이벤트 정보 등 광고성 정보로 관련 법의 규정을 준수하여 발송됩니다. 단, 광고성 정보 이외 의무적으로 안내되어야 하는 정보성 내용은 수신동의 여부와 무관하게 제공됩니다.<br>
                            <br>
                            <b>제4조 (철회안내)</b><br>
                            이용자는 수신 동의 이후에라도 의사에 따라 동의를 철회할 수 있습니다.<br>
                            <br>
                            <b>제5조 (수신동의 변경)</b><br>
                            고객센터(031-778-8346)을 통해 수신동의를 변경(동의/철회)할 수 있습니다.<br>
                            <br>
                            <b>제6조 (개인정보 이용 상세내용)</b><br>
                            이용하는 개인정보 - 보유 이용 목적<br>
                            휴대전화번호,이메일주소 - 혜택 정보,각종 이벤트 정보 등 광고성 정보 제공<br>
                        </v-card-text>
                    </v-card>
                </v-dialog>

                <v-card-text class="pa-0 pt-9 agree-content" style="float: left;">
                    <span style="float: left;">약관을 확인하였으며, 모두 동의합니다.</span>
                    <v-checkbox :ripple="false" v-model="agree" class="pa-0 ma-0" color="#2F80ED" style="display: inline-block; float: right;"></v-checkbox>
                </v-card-text>
            </v-card>
        </v-flex>
        <v-flex xs12 sm12 md12 class="d-flex flex-column justify-end align-top text-left">

        </v-flex>
        <v-flex xs12 sm12 md12 class="d-flex align-end pb-0">
            <v-flex xs12 sm12 md12 class="pa-0 justify-space-between">
                <v-card class="text-left pa-0" color="transparent" flat tile>
                    <v-card-text class="check-ok-info pb-6">
                        서비스 이용약관에 동의함으로써 이벤트, 혜택 등을 알려드리는 마케팅 정보 수신에 동의하게 됩니다.
                    </v-card-text>
                </v-card>
                <v-btn depressed tile :ripple="false" color="#2E3990" width="100%" height="50px" class="check-next" @click.native="goToWelcome" v-if="agree == true">다음</v-btn>
                <v-btn depressed disabled tile color="#E0E0E0" width="100%" height="50px" class="check-next" @click.native="goToWelcome" v-else>다음</v-btn>
            </v-flex>
        </v-flex>
    </v-layout>
</v-container>
</template>

<script>
export default {
    data: () => ({
        agree: false,
        serviceDialog: false,
        privacyDialog: false,
        marketingDialog: false
    }),

    methods: {
        servicePolicy() {
            this.serviceDialog = true;
        },

        privacyPolicy() {
            this.privacyDialog = true;
        },

        marketingInformation() {
            this.marketingDialog = true;
        },

        goToWelcome() {
            this.$router.replace('/auth/register')
        }
    }
}
</script>

<style scoped>
.v-dialog {
    border-radius: 10px !important;
}

.privacy_title {
    font-family: Noto Sans KR;
    font-style: normal;
    font-weight: 500;
    font-size: 16px;
    color: #2E3990;
}

.privacy_content {
    font-family: Noto Sans KR;
    font-style: normal;
    font-weight: normal;
    line-height: 17px;
    font-size: 12px !important;
    color: #4F4F4F;
}

.agree-title {
    font-family: Noto Sans KR;
    font-style: normal;
    font-weight: bold;
    font-size: 20px;
    color: #262626;
}

.agree-content {
    font-family: Noto Sans KR;
    font-style: normal;
    font-weight: normal;
    font-size: 14px;
    color: #828282;
}

.check-ok-info {
    font-family: Noto Sans KR;
    font-style: normal;
    font-weight: normal;
    font-size: 13px;
    letter-spacing: -0.035em;
    color: #A7A7A7;
}

.check-next {
    font-family: Noto Sans KR;
    font-style: normal;
    font-weight: 500;
    font-size: 16px;
    text-align: center;
    border-radius: 2px !important;
    color: #FFFFFF !important;
}
</style>
